#include <stdio.h>

void main()
{
	printf("나누기몫: %d, 나머지: %d\n",0 / 3 , 0 %3);
	printf("나누기몫: %d, 나머지: %d\n",1 / 3 , 1 %3);
	printf("나누기몫: %d, 나머지: %d\n",2 / 3 , 2 %3);
	printf("나누기몫: %d, 나머지: %d\n",3 / 3 , 3 %3);
	printf("나누기몫: %d, 나머지: %d\n",4 / 3 , 4 %3);
	printf("나누기몫: %d, 나머지: %d\n",5 / 3 , 5 %3);
	printf("나누기몫: %d, 나머지: %d\n",6 / 3 , 6 %3);
	printf("나누기몫: %d, 나머지: %d\n",7 / 3 , 7 %3);
	printf("나누기몫: %d, 나머지: %d\n",8 / 3 , 8 %3);
	printf("나누기몫: %d, 나머지: %d\n",9 / 3 , 9 %3);
	printf("나누기몫: %d, 나머지: %d\n",10 / 3 , 10 %3);

	
	


	
	



}