#include < stdio.h>
void main()

{
	int num0 = 0;
	int num1 = 1;
	int num2 = 2;
	int num3 = 3;
	int num4 = 4;
	int numArr[50]; 
	int i;
	//문제 1) numArr[0] ~ numArr[99]까지0~ 99 를 
	//       저장출력해보세요
	//ex printf("%d" , nummArr[55]) ,결과 : 55 
	numArr[0] = 0;
	numArr[1] = 1;
	numArr[2] = 2;
	numArr[3] = 3;
	for(i = 0; i < 20; i ++)
	{
		numArr[i] = i;
	}
	for(i = 0; i < 20; i++)
	{
		printf("i: %d\n" , numArr[i]);
	}
	//문제 1) 2정수를 입력받는데 
	//   1번정수는 위치 , 2번정수는 값을 입력받아보세요
	//문제 2)  numArr의 위치와 값이 바뀌도록 저장하세요
	// ex) 10 , 99 
	//0,1,2,3,4,5,6,7,8,9, 99 ,11,12,13,14,15,16,17,.....
	// ex) 0 , 88
	// 88 ,1 ,2 ,3 ,4 ,5, 6, 7, 8, 9.......
	//과제) 위치 2개를 입력받습니다
	//   두위치의 값이 서로 바뀌게 해보세요

	// ex) 10 , 15
	//0 ,1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,15 ,11 ,12,13,14 ,10 ,16,17,18,19
}