# include <stdio.h>

void main()
{
	//이중포문
	int i;
	int j;
	//for (i=0; i <5; i++)
	//{
	//	for(j=0; j <5; j++)
	//	{
	//		printf("i: %d ,j: %d \n", i, j);
	//		printf("*");
	//	}
	//}
	for (i=0; i <4; i++) //세로
	{
		for(j=0; j <5; j++) //가로
		{
			//printf("*");
		}
	
	}
	//문제 1)
	//*****
	//*****
	//*****
	//*****
	for (i=0; i <4; i++) //세로
	{
		for(j=0; j <5; j++) //가로
		{
			printf("*");
		}
		printf("\n");
	}
	//문제 2)
	//*
	//**
	//***
	//****
	for (i=0; i <4; i++) //세로
	{
		for(j=0; j <i+1; j++) //가로
		{
			printf("*");
		}
		printf("\n");
	}
	//문제3)
	//   *
	//  **
	// ***
	//****
	for (i=0; i <4; i++) //세로
	{
		for(j=0; j <i+1; j++) //가로
		{
			printf("*");
		}
		printf("\n");
	}
	//문제 4)
	//****
	//***
	//**
	//*
	//문제4)
	//
}